Acevedo_Ignacio/app/Controllers/catalogoController.php

    public function index()
    {
        $productosModel = new productosModel();
        $productosModel->join("categoria","producto.Id_categoria = categoria.Id_categoria","LEFT");
        $nombre = trim($this->request->getGet('nombre'));
        $order = trim($this->request->getGet('order')) ?? "Nombre_categoria";
        $data['order'] = $order;
        $data['nombre'] = $nombre;
        if (isset($nombre) && $nombre != '') {
            $data['productos'] = $productosModel->where('Producto.Activo_producto', 'si')->where('Producto.Cantidad_producto !=', 0)->groupStart()->like('Producto.Nombre_producto', $nombre)->orLike('Categoria.Nombre_categoria', $nombre)->groupEnd()->orderBy($order, 'ASC')->paginate(8);
            $data['pager'] = $productosModel->pager;
        } else {
            $data['productos'] = $productosModel->where('Producto.Activo_producto','si')->where('Producto.Cantidad_producto !=', 0)->orderBy($order, 'ASC')->paginate(8);
---
SELECT *
FROM `producto`
LEFT JOIN `categoria` ON `producto`.`Id_categoria` = `categoria`.`Id_categoria`
WHERE `Producto`.`Activo_producto` = 'si'
AND `Producto`.`Cantidad_producto` != 0
ORDER BY `Nombre_categoria` ASC
 LIMIT 8, 8
SELECT COUNT(*) AS `numrows`
FROM `producto`
LEFT JOIN `categoria` ON `producto`.`Id_categoria` = `categoria`.`Id_categoria`
WHERE `Producto`.`Activo_producto` = 'si'
AND `Producto`.`Cantidad_producto` != 0