Acevedo_Ignacio/app/Controllers/consultasController.php

SELECT *
FROM `consulta`
WHERE `visto_consulta` = 'no'
ORDER BY `Id_consulta` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `consulta`
WHERE `visto_consulta` = 'no'
---
    public function ver($vistos = 'no')
    {
        $session = session();
        if( empty($session->get('isAdmin')) ){
            return $this->response->redirect('/Acevedo_ignacio');
        }
        $consultasModel = new consultasModel();

        $nombre = $this->request->getGet('nombre');
        if (isset($nombre)) {
            $data['consultas'] = $consultasModel->where('visto_consulta', $vistos)->groupStart()->like('Asunto_consulta', $nombre)->orLike('Nombre_consulta', $nombre)->orLike('Apellido_consulta', $nombre)->groupEnd()->orderBy('Id_consulta', "ASC")->paginate(10);
            $data["pager"] = $consultasModel->pager;
        } else {
            $data['consultas'] = $consultasModel->where('visto_consulta', $vistos)->orderBy('Id_consulta', "ASC")->paginate(10);