Acevedo_Ignacio/app/Controllers/facturasController.php

SELECT *
FROM `factura`
WHERE `Fecha_factura` <= DATE_ADD('2024-02-10', INTERVAL 23 HOUR) AND `Fecha_factura` >= '2000-01-01'
ORDER BY `Fecha_factura` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `factura`
WHERE `Fecha_factura` <= DATE_ADD('2024-02-10', INTERVAL 23 HOUR) AND `Fecha_factura` >= '2000-01-01'
---
    public function index()
    {
        $facturasModel = new facturasModel();
        $session = session();
        if (empty($session->get('isAdmin'))) {
            return $this->response->redirect('/Acevedo_ignacio');
        }

        $desde = $this->request->getGet('Desde')? : '2000-01-01';
        $hasta = $this->request->getGet('Hasta')? : date('Y-m-d');

        //validar fecha
        if($desde <= $hasta && $hasta <= date('Y-m-d')) {

            $id = $this->request->getGet('id');
            if (isset($id)) {
                $data['facturas'] = $facturasModel->where('Id_factura', $id)->orGroupStart()->where('Id_usuario', $id)->groupEnd()->orderBy('Fecha_factura', "DESC")->paginate(10);
                $data["pager"] = $facturasModel->pager;

            } else if($desde != '' || $hasta != '') {

                //$desde = date('Y-m-d', strtotime($desde));
                //$hasta = date('Y-m-d', strtotime($hasta));

                $data['facturas'] = $facturasModel->where("Fecha_factura <= DATE_ADD('{$hasta}', INTERVAL 23 HOUR) AND Fecha_factura >='{$desde}'")->orderBy('Fecha_factura', "DESC")->paginate(10);