Acevedo_Ignacio/app/Controllers/Home.php

SELECT *
FROM `producto`
LEFT JOIN `categoria` ON `producto`.`Id_categoria` = `categoria`.`Id_categoria`
WHERE `Categoria`.`Nombre_categoria` = 'Corbatas'
AND `Producto`.`Cantidad_producto` != 0
ORDER BY `Id_producto` ASC
SELECT *
FROM `producto`
LEFT JOIN `categoria` ON `producto`.`Id_categoria` = `categoria`.`Id_categoria`
WHERE `Categoria`.`Nombre_categoria` = 'Billeteras'
AND `Producto`.`Cantidad_producto` != 0
ORDER BY `Id_producto` ASC
SELECT *
FROM `producto`
LEFT JOIN `categoria` ON `producto`.`Id_categoria` = `categoria`.`Id_categoria`
WHERE `Categoria`.`Nombre_categoria` = 'Relojes'
AND `Producto`.`Cantidad_producto` != 0
ORDER BY `Id_producto` ASC
---
    public function index()
    {
        $productosModel = new productosModel();
        $productosModel->join("categoria","producto.Id_categoria = categoria.Id_categoria","LEFT");
        $data['Corbatas'] = $productosModel->where('Categoria.Nombre_categoria', 'Corbatas')->where('Producto.Cantidad_producto !=', 0)->orderBy('Id_producto', 'ASC')->findAll();
        $data['primerCorbata'] = true;

        $productosModel = new productosModel();
        $productosModel->join("categoria","producto.Id_categoria = categoria.Id_categoria","LEFT");
        $data['Billeteras'] = $productosModel->where('Categoria.Nombre_categoria', 'Billeteras')->where('Producto.Cantidad_producto !=', 0)->orderBy('Id_producto', 'ASC')->findAll();
        $data['primerBilletera'] = true;

        $productosModel = new productosModel();
        $productosModel->join("categoria","producto.Id_categoria = categoria.Id_categoria","LEFT");
        $data['Relojes'] = $productosModel->where('Categoria.Nombre_categoria', 'Relojes')->where('Producto.Cantidad_producto !=', 0)->orderBy('Id_producto', 'ASC')->findAll();