Acevedo_Ignacio/app/Controllers/loginController.php

SELECT *
FROM `usuario`
WHERE `Correo_usuario` = 'b@gmail.com'
 LIMIT 1
SELECT *
FROM `rol`
WHERE `Nombre_rol` = 'Admin'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $userModel = new usuariosModel();
        $email = trim($this->request->getVar('email'));
        $password = trim($this->request->getVar('pass'));
        helper(['form']);
        $data = $userModel->where('Correo_usuario', $email)->first();

        if($data){
            $pass = $data['Password_usuario'];
            $authenticatePassword = password_verify($password, $pass);
            //$authenticatePassword =  $password == $pass;
            //password_hash();
            if($authenticatePassword){

                if($data['Activo_usuario'] == 'no'){
                    $session->setFlashdata('login', 'Este usuario se encuentra dado de baja.');
                    return view('loginView');
                }

                $admin = false;
                $rolModel = new rolModel();
                $rolCli = $rolModel->where('Nombre_rol', 'Admin')->first();