Acevedo_Ignacio/app/Controllers/productosController.php

    public function index($dadoBaja = 'si')
    {

        $session = session();
        if (empty($session->get('isAdmin'))) {
            return $this->response->redirect('/Acevedo_ignacio');
        }

        $nombre = trim($this->request->getGet('nombre'));
        if (isset($nombre) && $nombre != '') {
            $data['productos'] = $this->producto->where('Activo_producto', $dadoBaja)->groupStart()->like('Nombre_producto', $nombre)->orLike('Nombre_categoria', $nombre)->groupEnd()->orderBy('Id_producto', "ASC")->paginate(10);
            $data['categorias'] = $this->categoria->findAll();
            $data['pager'] = $this->producto->pager;
        } else {
            $data['productos'] = $this->producto->where('Activo_producto', $dadoBaja)->orderBy('Id_producto', "ASC")->paginate(10);
            $data['categorias'] = $this->categoria->findAll();
---
SELECT *
FROM `producto`
LEFT JOIN `Categoria` ON `Producto`.`Id_categoria` = `Categoria`.`Id_categoria`
WHERE `Producto`.`Activo_producto` = 'si'
ORDER BY `Producto`.`Id_producto` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `producto`
LEFT JOIN `Categoria` ON `Producto`.`Id_categoria` = `Categoria`.`Id_categoria`
WHERE `Producto`.`Activo_producto` = 'si'
SELECT *
FROM `categoria`