Acevedo_Ignacio/app/Controllers/usuariosController.php

    public function index($activo = 'si')
    {
        $this->usuario->join('Rol', 'usuario.Id_rol = rol.Id_rol', 'LEFT');
        $session = session();
        if (empty($session->get('isAdmin'))) {
            return $this->response->redirect('/Acevedo_ignacio');
        }

        $nombre = $this->request->getGet('nombre');
        if (isset($nombre)) {
            $data['usuarios'] = $this->usuario->where('Activo_usuario', $activo)->groupStart()->like('Apellido_usuario', $nombre)->orLike('Nombre_usuario', $nombre)->orLike('Correo_usuario', $nombre)->groupEnd()->orderBy('Id_usuario', "ASC")->paginate(10);
            $data['pager'] = $this->usuario->pager;
        } else {
            $data['usuarios'] = $this->usuario->where('Activo_usuario', $activo)->orderBy('Id_usuario', "ASC")->paginate(10);
---
SELECT *
FROM `usuario`
LEFT JOIN `Rol` ON `usuario`.`Id_rol` = `rol`.`Id_rol`
WHERE `Activo_usuario` = 'si'
ORDER BY `Id_usuario` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuario`
LEFT JOIN `Rol` ON `usuario`.`Id_rol` = `rol`.`Id_rol`
WHERE `Activo_usuario` = 'si'

    public function editar($id)
    {
        $session = session();
        if (empty($session->get('isAdmin'))) {
            return $this->response->redirect('/Acevedo_ignacio');
        }
        $this->usuario->join('rol', 'usuario.Id_rol = rol.Id_rol', 'LEFT');
        $data['usuario'] = $this->usuario->where('Id_usuario', $id)->first();
---
SELECT *
FROM `usuario`
LEFT JOIN `rol` ON `usuario`.`Id_rol` = `rol`.`Id_rol`
WHERE `Id_usuario` = '9'
 LIMIT 1